2D_Shear_Flowing/0/N2
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.767;

boundaryField
{
    fuel_inlet
    {
        type    fixedValue;
        value   uniform 0;
    }

    air_inlet
    {
        type    fixedValue;
        value   uniform 0.767;
    }

    outlet
    {
        type    zeroGradient;
    }

    upperWall
    {
        type    zeroGradient;
    }

    lowerWall
    {
        type    zeroGradient;
    }

    frontAndBack
    {
        type    empty;
    }
}
