2D_Shear_Flowing/0/NC12H26
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      NC12H26;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    fuel_inlet
    {
        type    fixedValue;
        value   uniform 1;
    }

    air_inlet
    {
        type    fixedValue;
        value   uniform 0;
    }

    outlet
    {
        type    zeroGradient;
    }

    upperWall
    {
        type    zeroGradient;
    }

    lowerWall
    {
        type    zeroGradient;
    }

    frontAndBack
    {
        type    empty;
    }
}
