2D_Shear_Flowing/0/k
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    fuel_inlet
    {
        type            fixedValue;
        value           uniform 0.375;
    }

    air_inlet
    {
        type            fixedValue;
        value           uniform 0.375;
    }

    outlet
    {
        type            zeroGradient;
    }

    upperWall
    {
        type  		kqRWallFunction;
    	value 		uniform 0.375;
    }

    lowerWall
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }

    frontAndBack
    {
        type            empty;
    }
}
