2D_Shear_Flowing/constant/combustionProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    object      combustionProperties;
}

combustionModel PaSR;

PaSRCoeffs
{
    Cmix 1.0;
}
