2D_Shear_Flowing/constant/momentumTransport
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}

simulationType   RAS;

RAS
{
    model           kEpsilon;
    turbulence      on;
}
