2D_Shear_Flowing/system/controlDict
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

functions
{
	#includeFunc MachNo
};

application     foamRun;

solver          multicomponentFluid;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.05;

deltaT          1e-05;

adjustTimeStep  yes;

maxCo           0.4;

maxDeltaT       2e-04;

writeControl    adjustableRunTime;

writeInterval   0.0001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;
