2D_Shear_Flowing/system/fvSolution
FoamFile
{
    format ascii;
    class dictionary;
    object fvSolution;
}

solvers
{
    "rho.*"
    {
        solver diagonal;
    }

	p
	{
	    solver          PCG;
	    preconditioner  DIC;
	    tolerance       1e-7;
	    relTol          0.01;
	}

    pFinal
    {
        $p;
        relTol 0;
    }

    "(U|h|k|epsilon)"
    {
        solver PBiCGStab;
        preconditioner DILU;
        tolerance 1e-7;
        relTol 0.05;
    }

    "(U|h|k|epsilon)Final"
    {
        $U;
        relTol 0;
    }

    "Yi.*"
    {
        solver PBiCGStab;
        preconditioner DILU;
        tolerance 1e-8;
        relTol 0;
    }
}

PIMPLE
{
    momentumPredictor yes;

    nOuterCorrectors 2;
    nCorrectors 2;
    nNonOrthogonalCorrectors 1;
}
